
// Напишите программу, которая на вход принемает число и выдаёт его квадрат (Число умноженное на себя).
//4-> 16
//-3 -> 9
//-7 -> 49

int x = -7;

int result = x * x;

Console.WriteLine("Квадрат числа  равен ");
Console.WriteLine(result);
