
// Напишите программу, которая на вход принемает число и выдаёт его квадрат (Число умноженное на себя).

int x = -3;

int result = x * x;

Console.WriteLine("Квадрат числа -3 равен ");
Console.WriteLine(result);
